In [3]:
import pandas as pd
import pickle
import matplotlib.pyplot as plt
import seaborn as sns
import datetime as dt
import math
import numpy as np

In [4]:
may = pd.read_csv('../data/may.csv/may.csv')

In [5]:
may.sumdgroup.unique()

array(['scooter', 'Scooter', 'bicycle'], dtype=object)

In [6]:
may_scooters = may.loc[may.sumdgroup.isin(['scooter', 'Scooter'])]

In [7]:
may_scooters = may_scooters[[ 'companyname', 'sumdid', 'chargelevel','pubdatetime', 'latitude', 'longitude']]

In [8]:
may_scooters.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20283582 entries, 0 to 20292502
Data columns (total 6 columns):
 #   Column       Dtype
---  ------       -----
 0   companyname  object
 1   sumdid       object
 2   chargelevel  float64
 3   pubdatetime  object
 4   latitude     float64
 5   longitude    float64
dtypes: float64(3), object(3)
memory usage: 1.1+ GB

In [9]:
may_scooters.to_pickle("../data/may.pkl")

In [10]:
may_scooters.pubdatetime = pd.to_datetime(may_scooters.pubdatetime)

In [11]:
may_scooters.head()

,companyname,sumdid,chargelevel,pubdatetime,latitude,longitude
0,Bird,PoweredLIRL1,93.0,2019-05-01 00:01:41.247,36.136822,-86.799877
1,Bird,PoweredXWRWC,35.0,2019-05-01 00:01:41.247,36.191252,-86.772945
2,Bird,PoweredMEJEH,90.0,2019-05-01 00:01:41.247,36.144752,-86.806293
3,Bird,Powered1A7TC,88.0,2019-05-01 00:01:41.247,36.162056,-86.774688
4,Bird,Powered2TYEF,98.0,2019-05-01 00:01:41.247,36.150973,-86.783109

In [12]:
may_scooters.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20283582 entries, 0 to 20292502
Data columns (total 6 columns):
 #   Column       Dtype
---  ------       -----
 0   companyname  object
 1   sumdid       object
 2   chargelevel  float64
 3   pubdatetime  datetime64[ns]
 4   latitude     float64
 5   longitude    float64
dtypes: datetime64[ns](1), float64(3), object(2)
memory usage: 1.1+ GB

In [13]:
may_scooters['date'] = may_scooters['pubdatetime'].dt.date

In [14]:
may_scooters.date = pd.to_datetime(may_scooters.date)

To round down to closest 15, this should work

15 * math.floor(number/15)

In [15]:
may_scooters.isnull().sum()

companyname      0
sumdid           0
chargelevel    283
pubdatetime      0
latitude         0
longitude        0
date             0
dtype: int64

In [16]:
may_scooters = may_scooters.dropna()

In [17]:
may_scooters

,companyname,sumdid,chargelevel,pubdatetime,latitude,longitude,date
0,Bird,PoweredLIRL1,93.0,2019-05-01 00:01:41.247,36.136822,-86.799877,2019-05-01
1,Bird,PoweredXWRWC,35.0,2019-05-01 00:01:41.247,36.191252,-86.772945,2019-05-01
2,Bird,PoweredMEJEH,90.0,2019-05-01 00:01:41.247,36.144752,-86.806293,2019-05-01
3,Bird,Powered1A7TC,88.0,2019-05-01 00:01:41.247,36.162056,-86.774688,2019-05-01
4,Bird,Powered2TYEF,98.0,2019-05-01 00:01:41.247,36.150973,-86.783109,2019-05-01
...,...,...,...,...,...,...,...
20292498,Jump,Poweredbb60ef04-c719-597f-805f-20978964fd8c,49.0,2019-05-31 23:59:42.000,36.163900,-86.782300,2019-05-31
20292499,Jump,Powered9f5743ed-7f81-539b-9e37-6503d54445d3,68.0,2019-05-31 23:59:42.000,36.160600,-86.776800,2019-05-31
20292500,Jump,Powered5744d1db-3bbe-55e5-9a23-a93828ba54fc,53.0,2019-05-31 23:59:42.000,36.160600,-86.776900,2019-05-31
20292501,Jump,Poweredad1d6d3b-162a-5bec-bffd-cac4ac8dee1c,42.0,2019-05-31 23:59:42.000,36.162400,-86.774500,2019-05-31
20292502,Jump,Powered8505008e-97c9-5003-8975-2ea6b2634fa0,76.0,2019-05-31 23:59:42.000,36.151900,-86.798500,2019-05-31

In [18]:
may_scooters.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20283299 entries, 0 to 20292502
Data columns (total 7 columns):
 #   Column       Dtype
---  ------       -----
 0   companyname  object
 1   sumdid       object
 2   chargelevel  float64
 3   pubdatetime  datetime64[ns]
 4   latitude     float64
 5   longitude    float64
 6   date         datetime64[ns]
dtypes: datetime64[ns](2), float64(3), object(2)
memory usage: 1.2+ GB

In [19]:
may_scooters['date'] = may_scooters['pubdatetime'].dt.date

In [20]:
may_scooters['hour'] = may_scooters['pubdatetime'].dt.hour

In [21]:
may_scooters['minute'] = may_scooters['pubdatetime'].dt.minute

In [22]:
may_scooters.head()

,companyname,sumdid,chargelevel,pubdatetime,latitude,longitude,date,hour,minute
0,Bird,PoweredLIRL1,93.0,2019-05-01 00:01:41.247,36.136822,-86.799877,2019-05-01,0,1
1,Bird,PoweredXWRWC,35.0,2019-05-01 00:01:41.247,36.191252,-86.772945,2019-05-01,0,1
2,Bird,PoweredMEJEH,90.0,2019-05-01 00:01:41.247,36.144752,-86.806293,2019-05-01,0,1
3,Bird,Powered1A7TC,88.0,2019-05-01 00:01:41.247,36.162056,-86.774688,2019-05-01,0,1
4,Bird,Powered2TYEF,98.0,2019-05-01 00:01:41.247,36.150973,-86.783109,2019-05-01,0,1

In [23]:
may_scooters.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20283299 entries, 0 to 20292502
Data columns (total 9 columns):
 #   Column       Dtype
---  ------       -----
 0   companyname  object
 1   sumdid       object
 2   chargelevel  float64
 3   pubdatetime  datetime64[ns]
 4   latitude     float64
 5   longitude    float64
 6   date         object
 7   hour         int64
 8   minute       int64
dtypes: datetime64[ns](1), float64(3), int64(2), object(3)
memory usage: 1.5+ GB

In [24]:
may_scooters['roundedtime'] = may_scooters['minute'].apply(lambda x: 15*round(x/15))

In [25]:
may_scooters = may_scooters.round({'latitude': 3})

In [26]:
may_scooters = may_scooters.round({'longitude': 3})

In [27]:
may_scooters

,companyname,sumdid,chargelevel,pubdatetime,latitude,longitude,date,hour,minute,roundedtime
0,Bird,PoweredLIRL1,93.0,2019-05-01 00:01:41.247,36.137,-86.800,2019-05-01,0,1,0
1,Bird,PoweredXWRWC,35.0,2019-05-01 00:01:41.247,36.191,-86.773,2019-05-01,0,1,0
2,Bird,PoweredMEJEH,90.0,2019-05-01 00:01:41.247,36.145,-86.806,2019-05-01,0,1,0
3,Bird,Powered1A7TC,88.0,2019-05-01 00:01:41.247,36.162,-86.775,2019-05-01,0,1,0
4,Bird,Powered2TYEF,98.0,2019-05-01 00:01:41.247,36.151,-86.783,2019-05-01,0,1,0
...,...,...,...,...,...,...,...,...,...,...
20292498,Jump,Poweredbb60ef04-c719-597f-805f-20978964fd8c,49.0,2019-05-31 23:59:42.000,36.164,-86.782,2019-05-31,23,59,60
20292499,Jump,Powered9f5743ed-7f81-539b-9e37-6503d54445d3,68.0,2019-05-31 23:59:42.000,36.161,-86.777,2019-05-31,23,59,60
20292500,Jump,Powered5744d1db-3bbe-55e5-9a23-a93828ba54fc,53.0,2019-05-31 23:59:42.000,36.161,-86.777,2019-05-31,23,59,60
20292501,Jump,Poweredad1d6d3b-162a-5bec-bffd-cac4ac8dee1c,42.0,2019-05-31 23:59:42.000,36.162,-86.774,2019-05-31,23,59,60
20292502,Jump,Powered8505008e-97c9-5003-8975-2ea6b2634fa0,76.0,2019-05-31 23:59:42.000,36.152,-86.798,2019-05-31,23,59,60

In [28]:
agg_time_scooters = may_scooters.loc[:,["latitude", "longitude", "date", "hour", "roundedtime", "sumdid"]]\
    .groupby(["latitude", "longitude", "date", "hour", "roundedtime"])\
    .agg({"sumdid": pd.Series.nunique})\
    .reset_index()

In [74]:
agg_time_scooters.head()

,latitude,longitude,date,hour,roundedtime,sumdid,day_of_week,Week_part
1051,32.789,-79.94,2019-05-28,20,30,1,Weekday,NaN
1052,32.789,-79.94,2019-05-28,20,45,1,Weekday,NaN
1053,32.789,-79.94,2019-05-28,20,60,1,Weekday,NaN
1054,32.789,-79.94,2019-05-28,21,0,1,Weekday,NaN
1055,32.789,-79.94,2019-05-28,21,15,1,Weekday,NaN

In [75]:
agg_time_scooters.drop(agg_time_scooters.loc[agg_time_scooters['latitude']==0].index, inplace=True)

In [32]:
agg_time_scooters

         latitude  longitude        date  hour  roundedtime  sumdid
1051       32.789    -79.940  2019-05-28    20           30       1
1052       32.789    -79.940  2019-05-28    20           45       1
1053       32.789    -79.940  2019-05-28    20           60       1
1054       32.789    -79.940  2019-05-28    21            0       1
1055       32.789    -79.940  2019-05-28    21           15       1
...           ...        ...         ...   ...          ...     ...
2960838    36.617    -87.285  2019-05-22    10            0       1
2960839    36.617    -87.285  2019-05-22    10           15       1
2960840    36.617    -87.285  2019-05-22    10           30       1
2960841    36.617    -87.285  2019-05-22    10           45       1
2960842    36.617    -87.285  2019-05-22    10           60       1

[2959792 rows x 6 columns]

In [33]:
agg_time_scooters.sort_values('sumdid', ascending = False).head(10)

       latitude  longitude        date  hour  roundedtime  sumdid
85303     36.12    -86.753  2019-05-26     9           30     475
85302     36.12    -86.753  2019-05-26     9           15     472
85304     36.12    -86.753  2019-05-26     9           45     471
85551     36.12    -86.753  2019-05-28    11            0     471
85422     36.12    -86.753  2019-05-27     9           15     470
85308     36.12    -86.753  2019-05-26    10           30     469
85549     36.12    -86.753  2019-05-28    10           45     469
85307     36.12    -86.753  2019-05-26    10           15     468
85309     36.12    -86.753  2019-05-26    10           45     468
85548     36.12    -86.753  2019-05-28    10           30     461

In [76]:
agg_time_scooters.drop(agg_time_scooters.loc[(agg_time_scooters['latitude']==36.12) & (agg_time_scooters['longitude'] == -86.753)].index, inplace=True)

In [77]:
agg_time_scooters.drop(agg_time_scooters.loc[(agg_time_scooters['latitude']==36.12) & (agg_time_scooters['longitude'] == -86.754)].index, inplace=True)

In [78]:
agg_time_scooters.sort_values('sumdid', ascending = False).head(10000)

,latitude,longitude,date,hour,roundedtime,sumdid,day_of_week,Week_part
102476,36.121,-86.770,2019-05-16,7,15,50,4,NaN
101636,36.121,-86.771,2019-05-29,8,30,50,3,NaN
2099735,36.164,-86.769,2019-05-22,18,15,50,3,NaN
2099733,36.164,-86.769,2019-05-22,17,60,50,3,NaN
103887,36.121,-86.770,2019-05-28,1,30,50,2,NaN
...,...,...,...,...,...,...,...,...
1346089,36.153,-86.790,2019-05-21,1,60,27,2,NaN
1344245,36.153,-86.790,2019-05-05,9,0,27,0,NaN
1858191,36.160,-86.775,2019-05-24,0,30,27,5,NaN
1643262,36.157,-86.781,2019-05-07,21,15,27,2,NaN
1654155,36.157,-86.776,2019-05-22,19,0,27,3,NaN

df= unique scooters, lat & long, date , hour, roundtime

In [79]:
agg_time_scooters.drop(agg_time_scooters.loc[agg_time_scooters['sumdid']>50].index, inplace=True)

In [80]:
agg_time_scooters.sort_values('sumdid', ascending = False)

,latitude,longitude,date,hour,roundedtime,sumdid,day_of_week,Week_part
102476,36.121,-86.770,2019-05-16,7,15,50,4,NaN
101636,36.121,-86.771,2019-05-29,8,30,50,3,NaN
2099735,36.164,-86.769,2019-05-22,18,15,50,3,NaN
2099733,36.164,-86.769,2019-05-22,17,60,50,3,NaN
103887,36.121,-86.770,2019-05-28,1,30,50,2,NaN
...,...,...,...,...,...,...,...,...
1158005,36.151,-86.794,2019-05-04,16,45,1,6,NaN
1158004,36.151,-86.794,2019-05-04,16,30,1,6,NaN
1158003,36.151,-86.794,2019-05-04,15,60,1,6,NaN
1158002,36.151,-86.794,2019-05-04,15,45,1,6,NaN
2960842,36.617,-87.285,2019-05-22,10,60,1,3,NaN

In [81]:
agg_time_scooters.sort_values('date', ascending = True)

,latitude,longitude,date,hour,roundedtime,sumdid,day_of_week,Week_part
2535444,36.175,-86.773,2019-05-01,23,30,1,3,NaN
71786,36.119,-86.768,2019-05-01,4,0,1,3,NaN
71785,36.119,-86.768,2019-05-01,3,60,1,3,NaN
71784,36.119,-86.768,2019-05-01,3,45,1,3,NaN
71783,36.119,-86.768,2019-05-01,3,30,1,3,NaN
...,...,...,...,...,...,...,...,...
1259238,36.152,-86.790,2019-05-31,5,60,5,5,NaN
1259237,36.152,-86.790,2019-05-31,5,45,6,5,NaN
1259236,36.152,-86.790,2019-05-31,5,30,6,5,NaN
1259248,36.152,-86.790,2019-05-31,7,60,3,5,NaN
2886230,36.191,-86.766,2019-05-31,5,45,2,5,NaN

Create 2 dataframes: 1 weekends the other weekdays
1- reformat days to group
2

In [82]:
agg_time_scooters['date']=pd.to_datetime(agg_time_scooters.date)

In [83]:
agg_time_scooters['day_of_week'] = agg_time_scooters.date.dt.strftime("%w")

In [61]:
agg_time_scooters

         latitude  longitude       date  hour  roundedtime  sumdid day_of_week
1051       32.789    -79.940 2019-05-28    20           30       1           2
1052       32.789    -79.940 2019-05-28    20           45       1           2
1053       32.789    -79.940 2019-05-28    20           60       1           2
1054       32.789    -79.940 2019-05-28    21            0       1           2
1055       32.789    -79.940 2019-05-28    21           15       1           2
...           ...        ...        ...   ...          ...     ...         ...
2960838    36.617    -87.285 2019-05-22    10            0       1           3
2960839    36.617    -87.285 2019-05-22    10           15       1           3
2960840    36.617    -87.285 2019-05-22    10           30       1           3
2960841    36.617    -87.285 2019-05-22    10           45       1           3
2960842    36.617    -87.285 2019-05-22    10           60       1           3

[2953466 rows x 7 columns]

In [68]:
Weekend_Scooters = agg_time_scooters[agg_time_scooters['day_of_week'].isin([6,0])]

In [70]:
Weekday_Scooters = agg_time_scooters[agg_time_scooters['day_of_week'].isin([1,2,3,4,5])]

In [71]:
Weekend_Scooters

,latitude,longitude,date,hour,roundedtime,sumdid,day_of_week,Week_part
4505,35.865,-86.343,2019-05-18,0,0,1,6,Weekend
4506,35.865,-86.343,2019-05-18,0,15,1,6,Weekend
4507,35.865,-86.343,2019-05-18,0,30,1,6,Weekend
4508,35.865,-86.343,2019-05-18,0,45,1,6,Weekend
4509,35.865,-86.343,2019-05-18,0,60,1,6,Weekend
...,...,...,...,...,...,...,...,...
2960686,36.330,-86.619,2019-05-26,2,30,1,0,NaN
2960687,36.335,-86.909,2019-05-18,21,45,1,6,NaN
2960688,36.335,-86.909,2019-05-18,21,60,1,6,NaN
2960709,36.380,-86.777,2019-05-05,3,0,1,0,NaN
2960710,36.380,-86.777,2019-05-05,3,15,1,0,NaN

In [72]:
Weekday_Scooters

,latitude,longitude,date,hour,roundedtime,sumdid,day_of_week,Week_part
1309,32.789,-79.940,2019-05-31,0,0,1,5,Weekend
1310,32.789,-79.940,2019-05-31,0,15,1,5,Weekend
1311,32.789,-79.940,2019-05-31,0,30,1,5,Weekend
1312,32.789,-79.940,2019-05-31,0,45,1,5,Weekend
1313,32.789,-79.940,2019-05-31,0,60,1,5,Weekend
...,...,...,...,...,...,...,...,...
2960838,36.617,-87.285,2019-05-22,10,0,1,3,NaN
2960839,36.617,-87.285,2019-05-22,10,15,1,3,NaN
2960840,36.617,-87.285,2019-05-22,10,30,1,3,NaN
2960841,36.617,-87.285,2019-05-22,10,45,1,3,NaN
2960842,36.617,-87.285,2019-05-22,10,60,1,3,NaN

In [65]:
agg_time_scooters['day_of_week'] = agg_time_scooters.day_of_week.astype(int)

for ind, row in agg_time_scooters.iterrows():
    print('working on row: ', ind)
    if row['day_of_week'] >= 5:
        agg_time_scooters.loc[ind, 'Week_part'] = 'Weekend'
    elif row['day_of_week'] <= 5:
        agg_time_scooters.loc[ind, 'day_of_week'] ='Weekday'
    else:
        agg_time_scooters.loc[ind, 'day_of_week'] ='NA'
print('finished!')

pivot = pd.pivot_table(may_scooters, values = 'sumdid', index ='roundedtime', aggfunc =pd.Series.nunique)
pivot

may_scooters.companyname.value_counts()

may_scooters = may_scooters[['sumdid', 'companyname','date','time','latitude', 'longitude', 'chargelevel']]

bird_scooters_may = may_scooters.loc[may_scooters['companyname'] == 'Bird'].sum()
df.pivot(index='foo', columns='bar', values='baz')